sarangnx/esp/sdkconfig.defaults
#
# Serial flasher config
#
# default:
# CONFIG_ESPTOOLPY_NO_STUB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_QIO is not set
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
# default:
CONFIG_ESPTOOLPY_FLASHMODE="dio"
# default:
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_40M is not set
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_26M is not set
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_16MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
# default:
# CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE is not set
# default:
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# default:
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
# default:
CONFIG_ESPTOOLPY_BEFORE="default-reset"
# default:
CONFIG_ESPTOOLPY_AFTER_RESET=y
# default:
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
# default:
CONFIG_ESPTOOLPY_AFTER="hard-reset"
# default:
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# end of Serial flasher config

#
# Partition Table
#
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_PARTITION_TABLE_TWO_OTA_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
# default:
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# default:
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# default:
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

#
# Compiler options
#
# default:
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
# default:
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
# default:
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set
# default:
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
# default:
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT is not set
# default:
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
# default:
# CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE is not set
# default:
CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB=y
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2
# default:
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
# default:
CONFIG_COMPILER_HIDE_PATHS_MACROS=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
# default:
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=0
# default:
# CONFIG_COMPILER_CXX_RTTI is not set
# default:
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# default:
# CONFIG_COMPILER_NO_MERGE_CONSTANTS is not set
# default:
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC12_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC13_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC14_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC15_WARNINGS is not set
# default:
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
# default:
CONFIG_COMPILER_RT_LIB_GCCLIB=y
# default:
CONFIG_COMPILER_RT_LIB_NAME="gcc"
# default:
CONFIG_COMPILER_ORPHAN_SECTIONS_ERROR=y
# default:
# CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING is not set
# default:
# CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE is not set
# default:
# CONFIG_COMPILER_STATIC_ANALYZER is not set
# default:
CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_NO_CHANGE=y
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD_CONSTEXPR is not set
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD is not set
# end of Compiler options

#
# Component config
#

#
# Bluetooth
#
# CONFIG_BT_ENABLED is not set

#
# Common Options
#

#
# BT Logs
#

#
# Log Sources
#
# end of Log Sources

# default:
# CONFIG_BT_LOG_CRITICAL_ONLY is not set
# default:
# CONFIG_BLE_LOG_ENABLED is not set

#
# Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
#
# default:
# CONFIG_BT_BLE_LOG_SPI_OUT_ENABLED is not set
# end of Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
# end of BT Logs

# default:
# CONFIG_BT_LE_USED_MEM_STATISTICS_ENABLED is not set
# end of Common Options
# end of Bluetooth

#
# Console Library
#
# default:
# CONFIG_CONSOLE_SORTED_HELP is not set
# end of Console Library

#
# Legacy Driver Configurations
#

#
# Legacy TWAI Driver Configurations
#
# default:
# CONFIG_TWAI_ISR_IN_IRAM_LEGACY is not set
# default:
# CONFIG_TWAI_SUPPRESS_DEPRECATE_WARN is not set
# default:
# CONFIG_TWAI_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy TWAI Driver Configurations

#
# Legacy I2C Driver Configurations
#
# default:
# CONFIG_I2C_SUPPRESS_DEPRECATE_WARN is not set
# default:
# CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy I2C Driver Configurations

#
# Legacy Touch Sensor Driver Configurations
#
# default:
# CONFIG_TOUCH_SUPPRESS_DEPRECATE_WARN is not set
# default:
# CONFIG_TOUCH_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy Touch Sensor Driver Configurations
# end of Legacy Driver Configurations

#
# eFuse Bit Manager
#
# default:
# CONFIG_EFUSE_CUSTOM_TABLE is not set
# default:
# CONFIG_EFUSE_VIRTUAL is not set
# default:
CONFIG_EFUSE_MAX_BLK_LEN=256
# end of eFuse Bit Manager

#
# ESP-TLS
#
# default:
CONFIG_ESP_TLS_USING_MBEDTLS=y
# default:
# CONFIG_ESP_TLS_CUSTOM_STACK is not set
# default:
# CONFIG_ESP_TLS_USE_SECURE_ELEMENT is not set
# default:
CONFIG_ESP_TLS_USE_DS_PERIPHERAL=y
# default:
# CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS is not set
# default:
# CONFIG_ESP_TLS_SERVER_SESSION_TICKETS is not set
# default:
# CONFIG_ESP_TLS_SERVER_CERT_SELECT_HOOK is not set
# default:
# CONFIG_ESP_TLS_SERVER_MIN_AUTH_MODE_OPTIONAL is not set
# default:
# CONFIG_ESP_TLS_PSK_VERIFICATION is not set
# default:
# CONFIG_ESP_TLS_INSECURE is not set
# default:
CONFIG_ESP_TLS_DYN_BUF_STRATEGY_SUPPORTED=y
# end of ESP-TLS

#
# ADC and ADC Calibration
#
# default:
# CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_ADC_CONTINUOUS_ISR_IRAM_SAFE is not set
# default:
CONFIG_ADC_DISABLE_DAC_OUTPUT=y
# default:
# CONFIG_ADC_ENABLE_DEBUG_LOG is not set
# end of ADC and ADC Calibration

#
# Wireless Coexistence
#
# default:
CONFIG_ESP_COEX_ENABLED=y
# default:
# CONFIG_ESP_COEX_EXTERNAL_COEXIST_ENABLE is not set
# default:
# CONFIG_ESP_COEX_GPIO_DEBUG is not set
# end of Wireless Coexistence

#
# Common ESP-related
#
# default:
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y
# default:
CONFIG_ESP_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# end of Common ESP-related

#
# ESP-Driver:DAC Configurations
#
# default:
# CONFIG_DAC_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_DAC_ISR_IRAM_SAFE is not set
# default:
# CONFIG_DAC_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:DAC Configurations

#
# ESP-Driver:GPIO Configurations
#
# default:
# CONFIG_GPIO_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:GPIO Configurations

#
# ESP-Driver:GPTimer Configurations
#
# default:
CONFIG_GPTIMER_ISR_HANDLER_IN_IRAM=y
# default:
# CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_GPTIMER_ISR_CACHE_SAFE is not set
# default:
CONFIG_GPTIMER_OBJ_CACHE_SAFE=y
# default:
# CONFIG_GPTIMER_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:GPTimer Configurations

#
# ESP-Driver:I2C Configurations
#
# default:
# CONFIG_I2C_ISR_IRAM_SAFE is not set
# default:
# CONFIG_I2C_ENABLE_DEBUG_LOG is not set
# default:
CONFIG_I2C_MASTER_ISR_HANDLER_IN_IRAM=y
# end of ESP-Driver:I2C Configurations

#
# ESP-Driver:I2S Configurations
#
# default:
# CONFIG_I2S_ISR_IRAM_SAFE is not set
# default:
# CONFIG_I2S_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_I2S_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:I2S Configurations

#
# ESP-Driver:I3C Master Configurations
#
# default:
# CONFIG_I3C_MASTER_ISR_CACHE_SAFE is not set
# default:
# CONFIG_I3C_MASTER_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_I3C_MASTER_ISR_HANDLER_IN_IRAM is not set
# end of ESP-Driver:I3C Master Configurations

#
# ESP-Driver:LEDC Configurations
#
# default:
# CONFIG_LEDC_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:LEDC Configurations

#
# ESP-Driver:PCNT Configurations
#
# default:
# CONFIG_PCNT_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_PCNT_ISR_IRAM_SAFE is not set
# default:
# CONFIG_PCNT_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:PCNT Configurations

#
# ESP-Driver:RMT Configurations
#
# default:
CONFIG_RMT_ENCODER_FUNC_IN_IRAM=y
# default:
CONFIG_RMT_TX_ISR_HANDLER_IN_IRAM=y
# default:
CONFIG_RMT_RX_ISR_HANDLER_IN_IRAM=y
# default:
# CONFIG_RMT_RECV_FUNC_IN_IRAM is not set
# default:
# CONFIG_RMT_TX_ISR_CACHE_SAFE is not set
# default:
# CONFIG_RMT_RX_ISR_CACHE_SAFE is not set
# default:
CONFIG_RMT_OBJ_CACHE_SAFE=y
# default:
# CONFIG_RMT_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_RMT_ISR_IRAM_SAFE is not set
# end of ESP-Driver:RMT Configurations

#
# ESP-Driver:Sigma Delta Modulator Configurations
#
# default:
# CONFIG_SDM_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_SDM_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:Sigma Delta Modulator Configurations

#
# ESP-Driver:SPI Configurations
#
# default:
CONFIG_SPI_MASTER_ISR_IN_IRAM=y
# default:
# CONFIG_SPI_SLAVE_IN_IRAM is not set
# default:
CONFIG_SPI_SLAVE_ISR_IN_IRAM=y
# end of ESP-Driver:SPI Configurations

#
# ESP-Driver:Touch Sensor Configurations
#
# default:
# CONFIG_TOUCH_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_TOUCH_ISR_IRAM_SAFE is not set
# default:
# CONFIG_TOUCH_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_TOUCH_SKIP_FSM_CHECK is not set
# end of ESP-Driver:Touch Sensor Configurations

#
# ESP-Driver:Temperature Sensor Configurations
#
# default:
# CONFIG_TEMP_SENSOR_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:Temperature Sensor Configurations

#
# ESP-Driver:TWAI Configurations
#
# default:
# CONFIG_TWAI_ISR_IN_IRAM is not set
# default:
# CONFIG_TWAI_IO_FUNC_IN_IRAM is not set
# default:
# CONFIG_TWAI_ISR_CACHE_SAFE is not set
# default:
# CONFIG_TWAI_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:TWAI Configurations

#
# ESP-Driver:UART Configurations
#
# default:
# CONFIG_UART_ISR_IN_IRAM is not set
# end of ESP-Driver:UART Configurations

#
# ESP-Driver:UHCI Configurations
#
# default:
# CONFIG_UHCI_ISR_HANDLER_IN_IRAM is not set
# default:
# CONFIG_UHCI_ISR_CACHE_SAFE is not set
# default:
# CONFIG_UHCI_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:UHCI Configurations

#
# Ethernet
#
# default:
CONFIG_ETH_ENABLED=y
# default:
CONFIG_ETH_USE_SPI_ETHERNET=y
# default:
# CONFIG_ETH_USE_OPENETH is not set
# default:
# CONFIG_ETH_TRANSMIT_MUTEX is not set
# end of Ethernet

#
# Event Loop Library
#
# default:
# CONFIG_ESP_EVENT_LOOP_PROFILING is not set
# default:
CONFIG_ESP_EVENT_POST_FROM_ISR=y
# default:
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=y
# end of Event Loop Library

#
# GDB Stub
#
# default:
CONFIG_ESP_GDBSTUB_ENABLED=y
# default:
# CONFIG_ESP_SYSTEM_GDBSTUB_RUNTIME is not set
# default:
CONFIG_ESP_GDBSTUB_SUPPORT_TASKS=y
# default:
CONFIG_ESP_GDBSTUB_MAX_TASKS=32
# end of GDB Stub

#
# ESP HID
#
# default:
CONFIG_ESPHID_TASK_SIZE_BT=2048
# default:
CONFIG_ESPHID_TASK_SIZE_BLE=4096
# end of ESP HID

#
# ESP HTTP client
#
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH is not set
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_DIGEST_AUTH is not set
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_CUSTOM_TRANSPORT is not set
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_GET_CONTENT_RANGE is not set
# default:
CONFIG_ESP_HTTP_CLIENT_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_ESP_HTTP_CLIENT_SAVE_RESPONSE_HEADERS is not set
# end of ESP HTTP client

#
# HTTP Server
#
# default:
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
# default:
CONFIG_HTTPD_MAX_URI_LEN=512
# default:
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
# default:
CONFIG_HTTPD_PURGE_BUF_LEN=32
# default:
# CONFIG_HTTPD_LOG_PURGE_DATA is not set
# default:
# CONFIG_HTTPD_WS_SUPPORT is not set
# default:
# CONFIG_HTTPD_QUEUE_WORK_BLOCKING is not set
# default:
CONFIG_HTTPD_SERVER_EVENT_POST_TIMEOUT=2000
# end of HTTP Server

#
# ESP HTTPS OTA
#
# default:
# CONFIG_ESP_HTTPS_OTA_DECRYPT_CB is not set
# default:
# CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP is not set
# default:
CONFIG_ESP_HTTPS_OTA_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_ESP_HTTPS_OTA_ENABLE_PARTIAL_DOWNLOAD is not set
# end of ESP HTTPS OTA

#
# ESP HTTPS server
#
# default:
# CONFIG_ESP_HTTPS_SERVER_ENABLE is not set
# default:
CONFIG_ESP_HTTPS_SERVER_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_ESP_HTTPS_SERVER_CERT_SELECT_HOOK is not set
# end of ESP HTTPS server

#
# Hardware Settings
#
# default:
CONFIG_ESP_HW_SUPPORT_FUNC_IN_IRAM=y

#
# Chip revision
#
# default:
CONFIG_ESP32S2_REV_MIN_0=y
# default:
# CONFIG_ESP32S2_REV_MIN_1 is not set
# default:
CONFIG_ESP32S2_REV_MIN_FULL=0
# default:
CONFIG_ESP_REV_MIN_FULL=0

#
# Maximum Supported ESP32-S2 Revision (Rev v1.99)
#
# default:
CONFIG_ESP32S2_REV_MAX_FULL=199
# default:
CONFIG_ESP_REV_MAX_FULL=199
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MIN_FULL=0
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MAX_FULL=99

#
# Maximum Supported ESP32-S2 eFuse Block Revision (eFuse Block Rev v0.99)
#
# end of Chip revision

#
# MAC Config
#
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_STA=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_AP=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES_TWO=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES=2
# default:
# CONFIG_ESP32S2_UNIVERSAL_MAC_ADDRESSES_ONE is not set
# default:
CONFIG_ESP32S2_UNIVERSAL_MAC_ADDRESSES_TWO=y
# default:
CONFIG_ESP32S2_UNIVERSAL_MAC_ADDRESSES=2
# default:
# CONFIG_ESP_MAC_USE_CUSTOM_MAC_AS_BASE_MAC is not set
# end of MAC Config

#
# Sleep Config
#
# default:
CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=y
# default:
CONFIG_ESP_SLEEP_PSRAM_LEAKAGE_WORKAROUND=y
# default:
# CONFIG_ESP_SLEEP_MSPI_NEED_ALL_IO_PU is not set
# default:
CONFIG_ESP_SLEEP_RTC_BUS_ISO_WORKAROUND=y
# default:
# CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND is not set
# default:
CONFIG_ESP_SLEEP_WAIT_FLASH_READY_EXTRA_DELAY=0
# default:
# CONFIG_ESP_SLEEP_CACHE_SAFE_ASSERTION is not set
# default:
# CONFIG_ESP_SLEEP_DEBUG is not set
# default:
CONFIG_ESP_SLEEP_GPIO_ENABLE_INTERNAL_RESISTORS=y
# end of Sleep Config

#
# RTC Clock Config
#
# default:
CONFIG_RTC_CLK_SRC_INT_RC=y
# default:
# CONFIG_RTC_CLK_SRC_EXT_CRYS is not set
# default:
# CONFIG_RTC_CLK_SRC_EXT_OSC is not set
# default:
# CONFIG_RTC_CLK_SRC_INT_8MD256 is not set
# default:
CONFIG_RTC_CLK_CAL_CYCLES=576
# default:
CONFIG_RTC_CLK_FUNC_IN_IRAM=y
# default:
CONFIG_RTC_TIME_FUNC_IN_IRAM=y
# end of RTC Clock Config

#
# Peripheral Control
#
# default:
CONFIG_ESP_PERIPH_CTRL_FUNC_IN_IRAM=y
# default:
CONFIG_ESP_REGI2C_CTRL_FUNC_IN_IRAM=y
# end of Peripheral Control

#
# Main XTAL Config
#
# default:
CONFIG_XTAL_FREQ_40=y
# default:
CONFIG_XTAL_FREQ=40
# end of Main XTAL Config

#
# Power Supplier
#

#
# Brownout Detector
#
# default:
CONFIG_ESP_BROWNOUT_DET=y
# default:
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_6 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_4 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_3 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_2 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_1 is not set
# default:
CONFIG_ESP_BROWNOUT_DET_LVL=7
# default:
CONFIG_ESP_BROWNOUT_USE_INTR=y
# end of Brownout Detector
# end of Power Supplier

# default:
CONFIG_ESP_SPI_BUS_LOCK_ISR_FUNCS_IN_IRAM=y
# default:
CONFIG_ESP_INTR_IN_IRAM=y
# end of Hardware Settings

#
# ESP-Driver:LCD Controller Configurations
#
# default:
# CONFIG_LCD_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:LCD Controller Configurations

#
# LibC
#
# default:
# CONFIG_LIBC_NEWLIB is not set
# default:
CONFIG_LIBC_PICOLIBC=y
# default:
CONFIG_LIBC_PICOLIBC_NEWLIB_COMPATIBILITY=y
# default:
CONFIG_LIBC_MISC_IN_IRAM=y
# default:
CONFIG_LIBC_LOCKS_PLACE_IN_IRAM=y
# default:
CONFIG_LIBC_STDOUT_LINE_ENDING_CRLF=y
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_LF is not set
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_CR is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_CRLF is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_LF is not set
# default:
CONFIG_LIBC_STDIN_LINE_ENDING_CR=y
# default:
CONFIG_LIBC_TIME_SYSCALL_USE_RTC_HRT=y
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_RTC is not set
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_HRT is not set
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_NONE is not set
# default:
CONFIG_LIBC_ASSERT_BUFFER_SIZE=200
# end of LibC

#
# ESP-MM: Memory Management Configurations
#
# default:
# CONFIG_ESP_MM_CACHE_MSYNC_C2M_CHUNKED_OPS is not set
# end of ESP-MM: Memory Management Configurations

#
# ESP NETIF Adapter
#
# default:
CONFIG_ESP_NETIF_LOST_IP_TIMER_ENABLE=y
# default:
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=120
# default:
# CONFIG_ESP_NETIF_PROVIDE_CUSTOM_IMPLEMENTATION is not set
# default:
CONFIG_ESP_NETIF_TCPIP_LWIP=y
# default:
# CONFIG_ESP_NETIF_LOOPBACK is not set
# default:
CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API=y
# default:
CONFIG_ESP_NETIF_REPORT_DATA_TRAFFIC=y
# default:
CONFIG_ESP_NETIF_RECEIVE_REPORT_ERRORS=y
# default:
# CONFIG_ESP_NETIF_L2_TAP is not set
# default:
# CONFIG_ESP_NETIF_BRIDGE_EN is not set
# default:
# CONFIG_ESP_NETIF_SET_DNS_PER_DEFAULT_NETIF is not set
# end of ESP NETIF Adapter

#
# Partition API Configuration
#
# end of Partition API Configuration

