sarangnx/esp/sdkconfig.defaults
#
# PHY
#
# default:
CONFIG_ESP_PHY_ENABLED=y
# default:
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=y
# default:
# CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION is not set
# default:
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=20
# default:
CONFIG_ESP_PHY_MAX_TX_POWER=20
# default:
# CONFIG_ESP_PHY_REDUCE_TX_POWER is not set
# default:
# CONFIG_ESP_PHY_ENABLE_CERT_TEST is not set
# default:
CONFIG_ESP_PHY_RF_CAL_PARTIAL=y
# default:
# CONFIG_ESP_PHY_RF_CAL_NONE is not set
# default:
# CONFIG_ESP_PHY_RF_CAL_FULL is not set
# default:
CONFIG_ESP_PHY_CALIBRATION_MODE=0
# default:
CONFIG_ESP_PHY_PLL_TRACK_PERIOD_MS=1000
# default:
# CONFIG_ESP_PHY_PLL_TRACK_DEBUG is not set
# default:
# CONFIG_ESP_PHY_RECORD_USED_TIME is not set
# default:
CONFIG_ESP_PHY_IRAM_OPT=y
# default:
# CONFIG_ESP_PHY_DEBUG is not set
# default:
CONFIG_ESP_PHY_ENABLE_VERSION_PRINT=y
# end of PHY

#
# Power Management
#
# default:
# CONFIG_PM_SLEEP_FUNC_IN_IRAM is not set
# default:
# CONFIG_PM_ENABLE is not set
# default:
# CONFIG_PM_SLP_IRAM_OPT is not set
# end of Power Management

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# SPI RAM config
#
# default:
CONFIG_SPIRAM_MODE_QUAD=y
# default:
CONFIG_SPIRAM_TYPE_AUTO=y
# default:
# CONFIG_SPIRAM_TYPE_ESPPSRAM16 is not set
# default:
# CONFIG_SPIRAM_TYPE_ESPPSRAM32 is not set
# default:
# CONFIG_SPIRAM_TYPE_ESPPSRAM64 is not set
# default:
CONFIG_SPIRAM_CLK_IO=30
# default:
CONFIG_SPIRAM_CS_IO=26
# default:
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set
# default:
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# default:
# CONFIG_SPIRAM_RODATA is not set
# default:
# CONFIG_SPIRAM_SPEED_80M is not set
# default:
CONFIG_SPIRAM_SPEED_40M=y
# default:
# CONFIG_SPIRAM_SPEED_26M is not set
# default:
# CONFIG_SPIRAM_SPEED_20M is not set
# default:
CONFIG_SPIRAM_SPEED=40
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_PRE_CONFIGURE_MEMORY_PROTECTION=y
# CONFIG_SPIRAM_USE_MEMMAP is not set
# CONFIG_SPIRAM_USE_CAPS_ALLOC is not set
CONFIG_SPIRAM_USE_MALLOC=y
# default:
CONFIG_SPIRAM_MEMTEST=y
# default:
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# default:
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# default:
# CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY is not set
# end of SPI RAM config
# end of ESP PSRAM

#
# ESP Ringbuf
#
# default:
# CONFIG_RINGBUF_IN_IRAM is not set
# default:
# CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH is not set
# end of ESP Ringbuf

#
# ESP-ROM
#
# default:
CONFIG_ESP_ROM_PRINT_IN_IRAM=y
# end of ESP-ROM

#
# ESP Security Specific
#
# end of ESP Security Specific

#
# ESP-STDIO
#
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_CONSOLE_USB_CDC=y
# CONFIG_ESP_CONSOLE_UART_CUSTOM is not set
# CONFIG_ESP_CONSOLE_NONE is not set
# default:
CONFIG_ESP_CONSOLE_UART_NUM=-1
# default:
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=3
# default:
CONFIG_ESP_CONSOLE_USB_CDC_RX_BUF_SIZE=64
# default:
# CONFIG_ESP_CONSOLE_USB_CDC_SUPPORT_ETS_PRINTF is not set
# end of ESP-STDIO

#
# ESP System Settings
#
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80 is not set
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160 is not set
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# default:
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

#
# Cache config
#
# default:
CONFIG_ESP32S2_INSTRUCTION_CACHE_8KB=y
# default:
# CONFIG_ESP32S2_INSTRUCTION_CACHE_16KB is not set
# default:
CONFIG_ESP32S2_INSTRUCTION_CACHE_SIZE=0x2000
# default:
# CONFIG_ESP32S2_INSTRUCTION_CACHE_LINE_16B is not set
# default:
CONFIG_ESP32S2_INSTRUCTION_CACHE_LINE_32B=y
# default:
CONFIG_ESP32S2_DATA_CACHE_8KB=y
# default:
# CONFIG_ESP32S2_DATA_CACHE_16KB is not set
# default:
CONFIG_ESP32S2_DATA_CACHE_SIZE=0x2000
# default:
# CONFIG_ESP32S2_DATA_CACHE_LINE_16B is not set
# default:
CONFIG_ESP32S2_DATA_CACHE_LINE_32B=y
# default:
# CONFIG_ESP32S2_INSTRUCTION_CACHE_WRAP is not set
# default:
# CONFIG_ESP32S2_DATA_CACHE_WRAP is not set
# end of Cache config

#
# Memory
#
# default:
# CONFIG_ESP32S2_RTCDATA_IN_FAST_MEM is not set
# default:
# CONFIG_ESP32S2_USE_FIXED_STATIC_RAM_SIZE is not set
# end of Memory

#
# Trace memory
#
# default:
# CONFIG_ESP32S2_TRAX is not set
# default:
CONFIG_ESP32S2_TRACEMEM_RESERVE_DRAM=0x0
# end of Trace memory

# default:
CONFIG_ESP_SYSTEM_IN_IRAM=y
# default:
# CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT is not set
# default:
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# default:
# CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT is not set
# default:
# CONFIG_ESP_SYSTEM_PANIC_GDBSTUB is not set
# default:
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=0
# default:
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y
# default:
CONFIG_ESP_SYSTEM_RTC_FAST_MEM_AS_HEAP_DEPCHECK=y
# default:
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=y
# default:
CONFIG_ESP_SYSTEM_MEMPROT=y
# default:
CONFIG_ESP_SYSTEM_MEMPROT_PMS=y
# default:
CONFIG_ESP_SYSTEM_MEMPROT_PMS_LOCK=y
# default:
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=32
# default:
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2304
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY is not set
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=2048
# default:
CONFIG_ESP_INT_WDT=y
# default:
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
# default:
CONFIG_ESP_TASK_WDT_EN=y
# default:
CONFIG_ESP_TASK_WDT_INIT=y
# default:
# CONFIG_ESP_TASK_WDT_PANIC is not set
# default:
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
# default:
# CONFIG_ESP_PANIC_HANDLER_IRAM is not set
# default:
# CONFIG_ESP_DEBUG_STUBS_ENABLE is not set
# default:
CONFIG_ESP_DEBUG_OCDAWARE=y
# default:
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_4=y
# default:
CONFIG_ESP32S2_KEEP_USB_ALIVE=y
# end of ESP System Settings

#
# IPC (Inter-Processor Call)
#
# default:
CONFIG_ESP_IPC_TASK_STACK_SIZE=1024
# end of IPC (Inter-Processor Call)

#
# ESP Timer (High Resolution Timer)
#
# default:
CONFIG_ESP_TIMER_IN_IRAM=y
# default:
# CONFIG_ESP_TIMER_PROFILING is not set
# default:
CONFIG_ESP_TIME_FUNCS_USE_RTC_TIMER=y
# default:
CONFIG_ESP_TIME_FUNCS_USE_ESP_TIMER=y
# default:
CONFIG_ESP_TIMER_TASK_STACK_SIZE=3584
# default:
CONFIG_ESP_TIMER_INTERRUPT_LEVEL=1
# default:
# CONFIG_ESP_TIMER_SHOW_EXPERIMENTAL is not set
# default:
CONFIG_ESP_TIMER_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU0=y
# default:
CONFIG_ESP_TIMER_ISR_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD is not set
# default:
CONFIG_ESP_TIMER_IMPL_SYSTIMER=y
# end of ESP Timer (High Resolution Timer)

#
# ESP Trace Configuration
#
# default:
# CONFIG_ESP_TRACE_LIB_EXTERNAL is not set
# default:
CONFIG_ESP_TRACE_LIB_NONE=y
# default:
CONFIG_ESP_TRACE_LIB_NAME="none"
# default:
# CONFIG_ESP_TRACE_TRANSPORT_APPTRACE is not set
# default:
CONFIG_ESP_TRACE_TRANSPORT_NONE=y
# default:
CONFIG_ESP_TRACE_TRANSPORT_NAME="none"
# end of ESP Trace Configuration

#
# Wi-Fi
#
# default:
CONFIG_ESP_WIFI_ENABLED=y
# default:
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
# default:
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
# default:
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
# default:
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
# default:
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=16
# default:
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=32
# default:
CONFIG_ESP_WIFI_STATIC_RX_MGMT_BUFFER=y
# default:
# CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER is not set
# default:
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=0
# default:
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=5
# default:
# CONFIG_ESP_WIFI_CSI_ENABLED is not set
# default:
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
# default:
CONFIG_ESP_WIFI_TX_BA_WIN=6
# default:
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
# default:
CONFIG_ESP_WIFI_RX_BA_WIN=16
# default:
# CONFIG_ESP_WIFI_AMSDU_TX_ENABLED is not set
# default:
CONFIG_ESP_WIFI_NVS_ENABLED=y
# default:
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=752
# default:
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=32
# default:
CONFIG_ESP_WIFI_IRAM_OPT=y
# default:
# CONFIG_ESP_WIFI_EXTRA_IRAM_OPT is not set
# default:
CONFIG_ESP_WIFI_RX_IRAM_OPT=y
# default:
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
# default:
CONFIG_ESP_WIFI_ENABLE_SAE_H2E=y
# default:
CONFIG_ESP_WIFI_ENABLE_SAE_PK=y
# default:
CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT=y
# default:
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=y
# default:
CONFIG_ESP_WIFI_WPA3_COMPATIBLE_SUPPORT=y
# default:
# CONFIG_ESP_WIFI_SLP_IRAM_OPT is not set
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_MIN_ACTIVE_TIME=50
# default:
# CONFIG_ESP_WIFI_BSS_MAX_IDLE_SUPPORT is not set
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_MAX_ACTIVE_TIME=10
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_WAIT_BROADCAST_DATA_TIME=15
# default:
# CONFIG_ESP_WIFI_FTM_ENABLE is not set
# default:
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y
# default:
CONFIG_ESP_WIFI_GMAC_SUPPORT=y
# default:
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# default:
# CONFIG_ESP_WIFI_SLP_BEACON_LOST_OPT is not set
# default:
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=7
# default:
# CONFIG_ESP_WIFI_NAN_SYNC_ENABLE is not set
# default:
CONFIG_ESP_WIFI_MBEDTLS_CRYPTO=y
# default:
CONFIG_ESP_WIFI_MBEDTLS_TLS_CLIENT=y
# default:
# CONFIG_ESP_WIFI_WAPI_PSK is not set
# default:
# CONFIG_ESP_WIFI_11KV_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_MBO_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_DPP_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_11R_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR is not set

#
# WPS Configuration Options
#
# default:
# CONFIG_ESP_WIFI_WPS_STRICT is not set
# default:
# CONFIG_ESP_WIFI_WPS_PASSPHRASE is not set
# default:
# CONFIG_ESP_WIFI_WPS_RECONNECT_ON_FAIL is not set
# end of WPS Configuration Options

# default:
# CONFIG_ESP_WIFI_DEBUG_PRINT is not set
# default:
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=y
# default:
# CONFIG_ESP_WIFI_ENT_FREE_DYNAMIC_BUFFER is not set
# default:
# CONFIG_ESP_WIFI_PASSIVE_HIDDEN_AP_SUPPORT is not set
# end of Wi-Fi

#
# Core dump
#
# default:
# CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH is not set
# default:
# CONFIG_ESP_COREDUMP_ENABLE_TO_UART is not set
# default:
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=y
# end of Core dump

#
# FAT Filesystem support
#
# default:
CONFIG_FATFS_VOLUME_COUNT=2
# default:
# CONFIG_FATFS_LFN_NONE is not set
# default:
CONFIG_FATFS_LFN_HEAP=y
# default:
# CONFIG_FATFS_LFN_STACK is not set
# default:
# CONFIG_FATFS_SECTOR_512 is not set
# default:
CONFIG_FATFS_SECTOR_4096=y
# default:
# CONFIG_FATFS_CODEPAGE_DYNAMIC is not set
# default:
CONFIG_FATFS_CODEPAGE_437=y
# default:
# CONFIG_FATFS_CODEPAGE_720 is not set
# default:
# CONFIG_FATFS_CODEPAGE_737 is not set
# default:
# CONFIG_FATFS_CODEPAGE_771 is not set
# default:
# CONFIG_FATFS_CODEPAGE_775 is not set
# default:
# CONFIG_FATFS_CODEPAGE_850 is not set
# default:
# CONFIG_FATFS_CODEPAGE_852 is not set
# default:
# CONFIG_FATFS_CODEPAGE_855 is not set
# default:
# CONFIG_FATFS_CODEPAGE_857 is not set
# default:
# CONFIG_FATFS_CODEPAGE_860 is not set
# default:
# CONFIG_FATFS_CODEPAGE_861 is not set
# default:
# CONFIG_FATFS_CODEPAGE_862 is not set
# default:
# CONFIG_FATFS_CODEPAGE_863 is not set
# default:
# CONFIG_FATFS_CODEPAGE_864 is not set
# default:
# CONFIG_FATFS_CODEPAGE_865 is not set
# default:
# CONFIG_FATFS_CODEPAGE_866 is not set
# default:
# CONFIG_FATFS_CODEPAGE_869 is not set
# default:
# CONFIG_FATFS_CODEPAGE_932 is not set
# default:
# CONFIG_FATFS_CODEPAGE_936 is not set
# default:
# CONFIG_FATFS_CODEPAGE_949 is not set
# default:
# CONFIG_FATFS_CODEPAGE_950 is not set
# default:
CONFIG_FATFS_CODEPAGE=437
# default:
CONFIG_FATFS_MAX_LFN=255
# default:
CONFIG_FATFS_API_ENCODING_ANSI_OEM=y
# default:
# CONFIG_FATFS_API_ENCODING_UTF_8 is not set
# default:
CONFIG_FATFS_FS_LOCK=0
# default:
CONFIG_FATFS_TIMEOUT_MS=10000
# default:
CONFIG_FATFS_PER_FILE_CACHE=y
# default:
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y
# default:
# CONFIG_FATFS_USE_FASTSEEK is not set
# default:
CONFIG_FATFS_USE_STRFUNC_NONE=y
# default:
# CONFIG_FATFS_USE_STRFUNC_WITHOUT_CRLF_CONV is not set
# default:
# CONFIG_FATFS_USE_STRFUNC_WITH_CRLF_CONV is not set
# default:
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=0
# default:
# CONFIG_FATFS_IMMEDIATE_FSYNC is not set
# default:
# CONFIG_FATFS_USE_LABEL is not set
# default:
CONFIG_FATFS_LINK_LOCK=y
# default:
CONFIG_FATFS_USE_DYN_BUFFERS=y

#
# File system free space calculation behavior
#
# default:
CONFIG_FATFS_DONT_TRUST_FREE_CLUSTER_CNT=0
# default:
CONFIG_FATFS_DONT_TRUST_LAST_ALLOC=0
# end of File system free space calculation behavior
# end of FAT Filesystem support

#
# FreeRTOS
#

#
# Kernel
#
# default:
# CONFIG_FREERTOS_SMP is not set
# default:
CONFIG_FREERTOS_UNICORE=y
# default:
CONFIG_FREERTOS_HZ=100
# default:
CONFIG_FREERTOS_OPTIMIZED_SCHEDULER=y
# default:
# CONFIG_FREERTOS_CHECK_STACKOVERFLOW_NONE is not set
# default:
# CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL is not set
# default:
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
# default:
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1
# default:
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
# default:
# CONFIG_FREERTOS_USE_IDLE_HOOK is not set
# default:
# CONFIG_FREERTOS_USE_TICK_HOOK is not set
# default:
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=16
# default:
# CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY is not set
# default:
CONFIG_FREERTOS_USE_TIMERS=y
# default:
CONFIG_FREERTOS_TIMER_SERVICE_TASK_NAME="Tmr Svc"
# default:
# CONFIG_FREERTOS_TIMER_TASK_AFFINITY_CPU0 is not set
# default:
CONFIG_FREERTOS_TIMER_TASK_NO_AFFINITY=y
# default:
CONFIG_FREERTOS_TIMER_SERVICE_TASK_CORE_AFFINITY=0x7FFFFFFF
# default:
CONFIG_FREERTOS_TIMER_TASK_PRIORITY=1
# default:
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2048
# default:
CONFIG_FREERTOS_TIMER_QUEUE_LENGTH=10
# default:
CONFIG_FREERTOS_QUEUE_REGISTRY_SIZE=0
# default:
CONFIG_FREERTOS_TASK_NOTIFICATION_ARRAY_ENTRIES=1
# default:
# CONFIG_FREERTOS_USE_TRACE_FACILITY is not set
# default:
# CONFIG_FREERTOS_USE_LIST_DATA_INTEGRITY_CHECK_BYTES is not set
# default:
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS is not set
# default:
# CONFIG_FREERTOS_USE_APPLICATION_TASK_TAG is not set
# end of Kernel

#
# Port
#
# default:
CONFIG_FREERTOS_TASK_FUNCTION_WRAPPER=y
# default:
# CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK is not set
# default:
CONFIG_FREERTOS_TLSP_DELETION_CALLBACKS=y
# default:
# CONFIG_FREERTOS_TASK_PRE_DELETION_HOOK is not set
# default:
CONFIG_FREERTOS_CHECK_MUTEX_GIVEN_BY_OWNER=y
# default:
CONFIG_FREERTOS_ISR_STACKSIZE=1536
# default:
CONFIG_FREERTOS_INTERRUPT_BACKTRACE=y
# default:
CONFIG_FREERTOS_TICK_SUPPORT_CORETIMER=y
# default:
CONFIG_FREERTOS_CORETIMER_0=y
# default:
# CONFIG_FREERTOS_CORETIMER_1 is not set
# default:
CONFIG_FREERTOS_SYSTICK_USES_CCOUNT=y
# default:
# CONFIG_FREERTOS_IN_IRAM is not set
# default:
# CONFIG_FREERTOS_CHECK_PORT_CRITICAL_COMPLIANCE is not set
# end of Port

#
# Extra
#
# default:
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
# end of Extra

# default:
CONFIG_FREERTOS_PORT=y
# default:
CONFIG_FREERTOS_NO_AFFINITY=0x7FFFFFFF
# default:
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
# default:
CONFIG_FREERTOS_DEBUG_OCDAWARE=y
# default:
CONFIG_FREERTOS_NUMBER_OF_CORES=1
# end of FreeRTOS

#
# Hardware Abstraction Layer (HAL) and Low Level (LL)
#
# default:
CONFIG_HAL_ASSERTION_EQUALS_SYSTEM=y
# default:
# CONFIG_HAL_ASSERTION_DISABLE is not set
# default:
# CONFIG_HAL_ASSERTION_SILENT is not set
# default:
# CONFIG_HAL_ASSERTION_ENABLE is not set
# default:
CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=2
# default:
CONFIG_HAL_GPIO_USE_ROM_IMPL=y
# end of Hardware Abstraction Layer (HAL) and Low Level (LL)

#
# Heap memory debugging
#
# default:
CONFIG_HEAP_POISONING_DISABLED=y
# default:
# CONFIG_HEAP_POISONING_LIGHT is not set
# default:
# CONFIG_HEAP_POISONING_COMPREHENSIVE is not set
# default:
CONFIG_HEAP_TRACING_OFF=y
# default:
# CONFIG_HEAP_TRACING_STANDALONE is not set
# default:
# CONFIG_HEAP_TRACING_TOHOST is not set
# default:
# CONFIG_HEAP_USE_HOOKS is not set
# default:
# CONFIG_HEAP_TASK_TRACKING is not set
# default:
# CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS is not set
# default:
# CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH is not set
# end of Heap memory debugging

#
# Log
#
# default:
CONFIG_LOG_VERSION_1=y
# default:
# CONFIG_LOG_VERSION_2 is not set
# default:
CONFIG_LOG_VERSION=1

#
# Log Level
#
# default:
# CONFIG_LOG_DEFAULT_LEVEL_NONE is not set
# default:
# CONFIG_LOG_DEFAULT_LEVEL_ERROR is not set
# default:
# CONFIG_LOG_DEFAULT_LEVEL_WARN is not set
# default:
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# default:
# CONFIG_LOG_DEFAULT_LEVEL_DEBUG is not set
# default:
# CONFIG_LOG_DEFAULT_LEVEL_VERBOSE is not set
# default:
CONFIG_LOG_DEFAULT_LEVEL=3
# default:
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_DEBUG is not set
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE is not set
# default:
CONFIG_LOG_MAXIMUM_LEVEL=3

#
# Level Settings
#
# default:
# CONFIG_LOG_MASTER_LEVEL is not set
# default:
CONFIG_LOG_DYNAMIC_LEVEL_CONTROL=y
# default:
# CONFIG_LOG_TAG_LEVEL_IMPL_NONE is not set
# default:
# CONFIG_LOG_TAG_LEVEL_IMPL_LINKED_LIST is not set
# default:
CONFIG_LOG_TAG_LEVEL_IMPL_CACHE_AND_LINKED_LIST=y
# default:
# CONFIG_LOG_TAG_LEVEL_CACHE_ARRAY is not set
# default:
CONFIG_LOG_TAG_LEVEL_CACHE_BINARY_MIN_HEAP=y
# default:
CONFIG_LOG_TAG_LEVEL_IMPL_CACHE_SIZE=31
# end of Level Settings
# end of Log Level

#
# Format
#
# default:
# CONFIG_LOG_COLORS is not set
# default:
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y
# default:
# CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM is not set
# end of Format

#
# Settings
#
# default:
CONFIG_LOG_MODE_TEXT_EN=y
# default:
CONFIG_LOG_MODE_TEXT=y
# end of Settings

# default:
CONFIG_LOG_IN_IRAM=y
# end of Log

