sarangnx/esp/sdkconfig.defaults
#
# Auto-detect flash chips
#
# default:
CONFIG_SPI_FLASH_VENDOR_XMC_SUPPORT_ENABLED=y
# default:
CONFIG_SPI_FLASH_VENDOR_GD_SUPPORT_ENABLED=y
# default:
CONFIG_SPI_FLASH_VENDOR_ISSI_SUPPORT_ENABLED=y
# default:
CONFIG_SPI_FLASH_VENDOR_MXIC_SUPPORT_ENABLED=y
# default:
CONFIG_SPI_FLASH_VENDOR_WINBOND_SUPPORT_ENABLED=y
# default:
CONFIG_SPI_FLASH_VENDOR_BOYA_SUPPORT_ENABLED=y
# default:
CONFIG_SPI_FLASH_VENDOR_TH_SUPPORT_ENABLED=y
# default:
CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP=y
# default:
CONFIG_SPI_FLASH_SUPPORT_MXIC_CHIP=y
# default:
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
# default:
CONFIG_SPI_FLASH_SUPPORT_WINBOND_CHIP=y
# default:
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y
# default:
CONFIG_SPI_FLASH_SUPPORT_TH_CHIP=y
# end of Auto-detect flash chips

# default:
CONFIG_SPI_FLASH_ENABLE_ENCRYPTED_READ_WRITE=y
# end of SPI Flash driver

#
# SPIFFS Configuration
#
# default:
CONFIG_SPIFFS_MAX_PARTITIONS=3

#
# SPIFFS Cache Configuration
#
# default:
CONFIG_SPIFFS_CACHE=y
# default:
CONFIG_SPIFFS_CACHE_WR=y
# default:
# CONFIG_SPIFFS_CACHE_STATS is not set
# end of SPIFFS Cache Configuration

# default:
CONFIG_SPIFFS_PAGE_CHECK=y
# default:
CONFIG_SPIFFS_GC_MAX_RUNS=10
# default:
# CONFIG_SPIFFS_GC_STATS is not set
# default:
CONFIG_SPIFFS_PAGE_SIZE=256
# default:
CONFIG_SPIFFS_OBJ_NAME_LEN=32
# default:
# CONFIG_SPIFFS_FOLLOW_SYMLINKS is not set
# default:
CONFIG_SPIFFS_USE_MAGIC=y
# default:
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
# default:
CONFIG_SPIFFS_META_LENGTH=4
# default:
CONFIG_SPIFFS_USE_MTIME=y

#
# Debug Configuration
#
# default:
# CONFIG_SPIFFS_DBG is not set
# default:
# CONFIG_SPIFFS_API_DBG is not set
# default:
# CONFIG_SPIFFS_GC_DBG is not set
# default:
# CONFIG_SPIFFS_CACHE_DBG is not set
# default:
# CONFIG_SPIFFS_CHECK_DBG is not set
# default:
# CONFIG_SPIFFS_TEST_VISUALISATION is not set
# end of Debug Configuration
# end of SPIFFS Configuration

#
# TCP Transport
#

#
# Websocket
#
# default:
CONFIG_WS_TRANSPORT=y
# default:
CONFIG_WS_BUFFER_SIZE=1024
# default:
# CONFIG_WS_DYNAMIC_BUFFER is not set
# end of Websocket
# end of TCP Transport

#
# Ultra Low Power (ULP) Co-processor
#
# default:
# CONFIG_ULP_COPROC_ENABLED is not set

#
# ULP Debugging Options
#
# end of ULP Debugging Options
# end of Ultra Low Power (ULP) Co-processor

#
# Unity unit testing library
#
# default:
CONFIG_UNITY_ENABLE_FLOAT=y
# default:
CONFIG_UNITY_ENABLE_DOUBLE=y
# default:
# CONFIG_UNITY_ENABLE_64BIT is not set
# default:
# CONFIG_UNITY_ENABLE_COLOR is not set
# default:
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
# default:
# CONFIG_UNITY_ENABLE_FIXTURE is not set
# default:
# CONFIG_UNITY_ENABLE_BACKTRACE_ON_FAIL is not set
# end of Unity unit testing library

#
# Virtual file system
#
# default:
CONFIG_VFS_SUPPORT_IO=y
# default:
CONFIG_VFS_SUPPORT_DIR=y
# default:
CONFIG_VFS_SUPPORT_SELECT=y
# default:
CONFIG_VFS_SUPPRESS_SELECT_DEBUG_OUTPUT=y
# default:
# CONFIG_VFS_SELECT_IN_RAM is not set
# default:
# CONFIG_VFS_SUPPORT_TERMIOS is not set
# default:
CONFIG_VFS_MAX_COUNT=8
# default:
# CONFIG_VFS_SUPPRESS_CTX_DEPRECATION is not set

#
# Host File System I/O (Semihosting)
#
# default:
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=1
# end of Host File System I/O (Semihosting)

# default:
CONFIG_VFS_INITIALIZE_DEV_NULL=y
# end of Virtual file system

#
# Wear Levelling
#
# default:
# CONFIG_WL_SECTOR_SIZE_512 is not set
# default:
CONFIG_WL_SECTOR_SIZE_4096=y
# default:
CONFIG_WL_SECTOR_SIZE=4096
# end of Wear Levelling

#
# ESP LVGL PORT
#
# end of ESP LVGL PORT

#
# LVGL configuration
#
# CONFIG_LV_CONF_SKIP is not set
# CONFIG_LV_CONF_MINIMAL is not set

#
# Color Settings
#
# default:
# CONFIG_LV_COLOR_DEPTH_32 is not set
# default:
# CONFIG_LV_COLOR_DEPTH_24 is not set
# default:
CONFIG_LV_COLOR_DEPTH_16=y
# default:
# CONFIG_LV_COLOR_DEPTH_8 is not set
# default:
# CONFIG_LV_COLOR_DEPTH_1 is not set
# default:
CONFIG_LV_COLOR_DEPTH=16
# end of Color Settings

#
# Memory Settings
#
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
# CONFIG_LV_USE_MICROPYTHON_MALLOC is not set
# CONFIG_LV_USE_RTTHREAD_MALLOC is not set
# CONFIG_LV_USE_CUSTOM_MALLOC is not set
# default:
CONFIG_LV_USE_BUILTIN_STRING=y
# default:
# CONFIG_LV_USE_CLIB_STRING is not set
# default:
# CONFIG_LV_USE_CUSTOM_STRING is not set
# default:
CONFIG_LV_USE_BUILTIN_SPRINTF=y
# default:
# CONFIG_LV_USE_CLIB_SPRINTF is not set
# default:
# CONFIG_LV_USE_CUSTOM_SPRINTF is not set
# end of Memory Settings

#
# HAL Settings
#
# default:
CONFIG_LV_DEF_REFR_PERIOD=33
# default:
CONFIG_LV_DPI_DEF=130
# end of HAL Settings

#
# Operating System (OS)
#
# default:
CONFIG_LV_OS_NONE=y
# default:
# CONFIG_LV_OS_PTHREAD is not set
# default:
# CONFIG_LV_OS_FREERTOS is not set
# default:
# CONFIG_LV_OS_CMSIS_RTOS2 is not set
# default:
# CONFIG_LV_OS_RTTHREAD is not set
# default:
# CONFIG_LV_OS_WINDOWS is not set
# default:
# CONFIG_LV_OS_MQX is not set
# default:
# CONFIG_LV_OS_SDL2 is not set
# default:
# CONFIG_LV_OS_CUSTOM is not set
# end of Operating System (OS)

#
# Rendering Configuration
#
# default:
CONFIG_LV_DRAW_BUF_STRIDE_ALIGN=1
# default:
CONFIG_LV_DRAW_BUF_ALIGN=4
# default:
CONFIG_LV_DRAW_LAYER_SIMPLE_BUF_SIZE=24576
# default:
CONFIG_LV_DRAW_LAYER_MAX_MEMORY=0
# default:
CONFIG_LV_USE_DRAW_SW=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_RGB565=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_RGB565A8=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_RGB888=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_XRGB8888=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_ARGB8888=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_ARGB8888_PREMULTIPLIED=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_L8=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_AL88=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_A8=y
# default:
CONFIG_LV_DRAW_SW_SUPPORT_I1=y
# default:
CONFIG_LV_DRAW_SW_I1_LUM_THRESHOLD=127
# default:
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
# default:
# CONFIG_LV_USE_DRAW_ARM2D_SYNC is not set
# default:
# CONFIG_LV_USE_NATIVE_HELIUM_ASM is not set
# default:
CONFIG_LV_DRAW_SW_COMPLEX=y
# default:
# CONFIG_LV_USE_DRAW_SW_COMPLEX_GRADIENTS is not set
# default:
CONFIG_LV_DRAW_SW_SHADOW_CACHE_SIZE=0
# default:
CONFIG_LV_DRAW_SW_CIRCLE_CACHE_SIZE=4
# default:
CONFIG_LV_DRAW_SW_ASM_NONE=y
# default:
# CONFIG_LV_DRAW_SW_ASM_NEON is not set
# default:
# CONFIG_LV_DRAW_SW_ASM_HELIUM is not set
# default:
# CONFIG_LV_DRAW_SW_ASM_RISCV_V is not set
# default:
# CONFIG_LV_DRAW_SW_ASM_CUSTOM is not set
# default:
CONFIG_LV_USE_DRAW_SW_ASM=0
# default:
# CONFIG_LV_USE_PXP is not set
# default:
# CONFIG_LV_USE_G2D is not set
# default:
# CONFIG_LV_USE_DRAW_DAVE2D is not set
# default:
# CONFIG_LV_USE_DRAW_SDL is not set
# default:
# CONFIG_LV_USE_DRAW_VG_LITE is not set
# default:
# CONFIG_LV_USE_VECTOR_GRAPHIC is not set
# default:
# CONFIG_LV_USE_DRAW_DMA2D is not set
# default:
# CONFIG_LV_USE_PPA is not set
# default:
# CONFIG_LV_USE_DRAW_EVE is not set
# end of Rendering Configuration

#
# Feature Configuration
#

#
# Logging
#
# default:
# CONFIG_LV_USE_LOG is not set
# end of Logging

#
# Asserts
#
# default:
CONFIG_LV_USE_ASSERT_NULL=y
# default:
CONFIG_LV_USE_ASSERT_MALLOC=y
# default:
# CONFIG_LV_USE_ASSERT_STYLE is not set
# default:
# CONFIG_LV_USE_ASSERT_MEM_INTEGRITY is not set
# default:
# CONFIG_LV_USE_ASSERT_OBJ is not set
# default:
CONFIG_LV_ASSERT_HANDLER_INCLUDE="assert.h"
# end of Asserts

#
# Debug
#
# default:
# CONFIG_LV_USE_REFR_DEBUG is not set
# default:
# CONFIG_LV_USE_LAYER_DEBUG is not set
# default:
# CONFIG_LV_USE_PARALLEL_DRAW_DEBUG is not set
# end of Debug

#
# Others
#
# default:
# CONFIG_LV_ENABLE_GLOBAL_CUSTOM is not set
# default:
CONFIG_LV_CACHE_DEF_SIZE=0
# default:
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=0
# default:
CONFIG_LV_GRADIENT_MAX_STOPS=2
# default:
CONFIG_LV_COLOR_MIX_ROUND_OFS=128
# default:
# CONFIG_LV_OBJ_STYLE_CACHE is not set
# default:
# CONFIG_LV_USE_OBJ_ID is not set
# default:
# CONFIG_LV_USE_OBJ_NAME is not set
# default:
# CONFIG_LV_USE_OBJ_PROPERTY is not set
# default:
# CONFIG_LV_USE_EXT_DATA is not set
# end of Others
# end of Feature Configuration

#
# Compiler Settings
#
# default:
# CONFIG_LV_BIG_ENDIAN_SYSTEM is not set
# default:
CONFIG_LV_ATTRIBUTE_MEM_ALIGN_SIZE=1
# default:
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set
# default:
# CONFIG_LV_USE_FLOAT is not set
# default:
# CONFIG_LV_USE_MATRIX is not set
# default:
# CONFIG_LV_USE_PRIVATE_API is not set
# end of Compiler Settings

#
# Font Usage
#

#
# Enable built-in fonts
#
# default:
# CONFIG_LV_FONT_MONTSERRAT_8 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_10 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_12 is not set
# default:
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# default:
# CONFIG_LV_FONT_MONTSERRAT_22 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_24 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_26 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_28 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_30 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_32 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_34 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_36 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_38 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_40 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_42 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_44 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_46 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_48 is not set
# default:
# CONFIG_LV_FONT_MONTSERRAT_28_COMPRESSED is not set
# default:
# CONFIG_LV_FONT_DEJAVU_16_PERSIAN_HEBREW is not set
# default:
# CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_14_CJK is not set
# default:
# CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK is not set
# default:
# CONFIG_LV_FONT_UNSCII_8 is not set
# default:
# CONFIG_LV_FONT_UNSCII_16 is not set
# end of Enable built-in fonts

# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_8 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_10 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_12 is not set
# default:
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_16 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_18 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_20 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_22 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_24 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_26 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_28 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_30 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_32 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_34 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_36 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_38 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_40 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_42 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_44 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_46 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_48 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_MONTSERRAT_28_COMPRESSED is not set
# default:
# CONFIG_LV_FONT_DEFAULT_DEJAVU_16_PERSIAN_HEBREW is not set
# default:
# CONFIG_LV_FONT_DEFAULT_SOURCE_HAN_SANS_SC_14_CJK is not set
# default:
# CONFIG_LV_FONT_DEFAULT_SOURCE_HAN_SANS_SC_16_CJK is not set
# default:
# CONFIG_LV_FONT_DEFAULT_UNSCII_8 is not set
# default:
# CONFIG_LV_FONT_DEFAULT_UNSCII_16 is not set
# default:
# CONFIG_LV_FONT_FMT_TXT_LARGE is not set
# default:
# CONFIG_LV_USE_FONT_COMPRESSED is not set
# default:
CONFIG_LV_USE_FONT_PLACEHOLDER=y

#
# Enable static fonts
#
# end of Enable static fonts
# end of Font Usage

#
# Text Settings
#
# default:
CONFIG_LV_TXT_ENC_UTF8=y
# default:
# CONFIG_LV_TXT_ENC_ASCII is not set
# default:
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_)}"
# default:
CONFIG_LV_TXT_LINE_BREAK_LONG_LEN=0
# default:
CONFIG_LV_TXT_COLOR_CMD="#"
# default:
# CONFIG_LV_USE_BIDI is not set
# default:
# CONFIG_LV_USE_ARABIC_PERSIAN_CHARS is not set
# end of Text Settings

#
# Widget Usage
#
# default:
CONFIG_LV_WIDGETS_HAS_DEFAULT_VALUE=y
# default:
CONFIG_LV_USE_ANIMIMG=y
# default:
CONFIG_LV_USE_ARC=y
# default:
CONFIG_LV_USE_ARCLABEL=y
# default:
CONFIG_LV_USE_BAR=y
# default:
CONFIG_LV_USE_BUTTON=y
# default:
CONFIG_LV_USE_BUTTONMATRIX=y
# default:
CONFIG_LV_USE_CALENDAR=y
# default:
# CONFIG_LV_CALENDAR_WEEK_STARTS_MONDAY is not set

#
# Days name configuration
#
# default:
CONFIG_LV_MONDAY_STR="Mo"
# default:
CONFIG_LV_TUESDAY_STR="Tu"
# default:
CONFIG_LV_WEDNESDAY_STR="We"
# default:
CONFIG_LV_THURSDAY_STR="Th"
# default:
CONFIG_LV_FRIDAY_STR="Fr"
# default:
CONFIG_LV_SATURDAY_STR="Sa"
# default:
CONFIG_LV_SUNDAY_STR="Su"
# end of Days name configuration

# default:
CONFIG_LV_USE_CALENDAR_HEADER_ARROW=y
# default:
CONFIG_LV_USE_CALENDAR_HEADER_DROPDOWN=y
# default:
# CONFIG_LV_USE_CALENDAR_CHINESE is not set
# default:
CONFIG_LV_USE_CANVAS=y
# default:
CONFIG_LV_USE_CHART=y
# default:
CONFIG_LV_USE_CHECKBOX=y
# default:
CONFIG_LV_USE_DROPDOWN=y
# default:
CONFIG_LV_USE_IMAGE=y
# default:
CONFIG_LV_USE_IMAGEBUTTON=y
# default:
CONFIG_LV_USE_KEYBOARD=y
# default:
CONFIG_LV_USE_LABEL=y
# default:
CONFIG_LV_LABEL_TEXT_SELECTION=y
# default:
CONFIG_LV_LABEL_LONG_TXT_HINT=y
# default:
CONFIG_LV_LABEL_WAIT_CHAR_COUNT=3
# default:
CONFIG_LV_USE_LED=y
# default:
CONFIG_LV_USE_LINE=y
# default:
CONFIG_LV_USE_LIST=y
# default:
CONFIG_LV_USE_MENU=y
# default:
CONFIG_LV_USE_MSGBOX=y
# default:
CONFIG_LV_USE_ROLLER=y
# default:
CONFIG_LV_USE_SCALE=y
# default:
CONFIG_LV_USE_SLIDER=y
# default:
CONFIG_LV_USE_SPAN=y
# default:
CONFIG_LV_SPAN_SNIPPET_STACK_SIZE=64
# default:
CONFIG_LV_USE_SPINBOX=y
# default:
CONFIG_LV_USE_SPINNER=y
# default:
CONFIG_LV_USE_SWITCH=y
# default:
CONFIG_LV_USE_TEXTAREA=y
# default:
CONFIG_LV_TEXTAREA_DEF_PWD_SHOW_TIME=1500
# default:
CONFIG_LV_USE_TABLE=y
# default:
CONFIG_LV_USE_TABVIEW=y
# default:
CONFIG_LV_USE_TILEVIEW=y
# default:
CONFIG_LV_USE_WIN=y
# end of Widget Usage

#
# Themes
#
# default:
CONFIG_LV_USE_THEME_DEFAULT=y
# default:
# CONFIG_LV_THEME_DEFAULT_DARK is not set
# default:
CONFIG_LV_THEME_DEFAULT_GROW=y
# default:
CONFIG_LV_THEME_DEFAULT_TRANSITION_TIME=80
# default:
CONFIG_LV_USE_THEME_SIMPLE=y
# default:
# CONFIG_LV_USE_THEME_MONO is not set
# end of Themes

#
# Layouts
#
# default:
CONFIG_LV_USE_FLEX=y
# default:
CONFIG_LV_USE_GRID=y
# end of Layouts

#
# 3rd Party Libraries
#
# default:
CONFIG_LV_FS_DEFAULT_DRIVER_LETTER=0
# default:
# CONFIG_LV_USE_FS_STDIO is not set
# default:
# CONFIG_LV_USE_FS_POSIX is not set
# default:
# CONFIG_LV_USE_FS_WIN32 is not set
# default:
# CONFIG_LV_USE_FS_FATFS is not set
# default:
# CONFIG_LV_USE_FS_MEMFS is not set
# default:
# CONFIG_LV_USE_FS_LITTLEFS is not set
# default:
# CONFIG_LV_USE_FS_ARDUINO_ESP_LITTLEFS is not set
# default:
# CONFIG_LV_USE_FS_ARDUINO_SD is not set
# default:
# CONFIG_LV_USE_FS_UEFI is not set
# default:
# CONFIG_LV_USE_FS_FROGFS is not set
# default:
# CONFIG_LV_USE_LODEPNG is not set
# default:
# CONFIG_LV_USE_LIBPNG is not set
# default:
# CONFIG_LV_USE_BMP is not set
# default:
# CONFIG_LV_USE_TJPGD is not set
# default:
# CONFIG_LV_USE_LIBJPEG_TURBO is not set
# default:
# CONFIG_LV_USE_LIBWEBP is not set
# default:
# CONFIG_LV_USE_GIF is not set
# default:
# CONFIG_LV_BIN_DECODER_RAM_LOAD is not set
# default:
# CONFIG_LV_USE_RLE is not set
# default:
# CONFIG_LV_USE_QRCODE is not set
# default:
# CONFIG_LV_USE_BARCODE is not set
# default:
# CONFIG_LV_USE_FREETYPE is not set
# default:
# CONFIG_LV_USE_TINY_TTF is not set
# default:
# CONFIG_LV_USE_RLOTTIE is not set
# default:
# CONFIG_LV_USE_THORVG is not set
# default:
# CONFIG_LV_USE_NANOVG is not set
# default:
# CONFIG_LV_USE_LZ4 is not set
# default:
# CONFIG_LV_USE_FFMPEG is not set
# end of 3rd Party Libraries

#
# Others
#
# default:
# CONFIG_LV_USE_SNAPSHOT is not set
# default:
# CONFIG_LV_USE_SYSMON is not set
# default:
# CONFIG_LV_USE_PROFILER is not set
# default:
# CONFIG_LV_USE_MONKEY is not set
# default:
# CONFIG_LV_USE_GRIDNAV is not set
# default:
# CONFIG_LV_USE_FRAGMENT is not set
# default:
# CONFIG_LV_USE_IMGFONT is not set
# default:
CONFIG_LV_USE_OBSERVER=y
# default:
# CONFIG_LV_USE_IME_PINYIN is not set
# default:
# CONFIG_LV_USE_FILE_EXPLORER is not set
# default:
# CONFIG_LV_USE_FONT_MANAGER is not set
# default:
# CONFIG_LV_USE_TEST is not set
# default:
# CONFIG_LV_USE_TRANSLATION is not set
# default:
# CONFIG_LV_USE_COLOR_FILTER is not set
# default:
CONFIG_LVGL_VERSION_MAJOR=9
# default:
CONFIG_LVGL_VERSION_MINOR=5
# default:
CONFIG_LVGL_VERSION_PATCH=0
# end of Others

#
# Devices
#
# CONFIG_LV_USE_SDL is not set
# default:
# CONFIG_LV_USE_X11 is not set
# default:
# CONFIG_LV_USE_WAYLAND is not set
# default:
# CONFIG_LV_USE_LINUX_FBDEV is not set
# default:
# CONFIG_LV_USE_NUTTX is not set
# default:
# CONFIG_LV_USE_LINUX_DRM is not set
# default:
# CONFIG_LV_USE_TFT_ESPI is not set
# default:
# CONFIG_LV_USE_LOVYAN_GFX is not set
# default:
# CONFIG_LV_USE_EVDEV is not set
# default:
# CONFIG_LV_USE_LIBINPUT is not set
# default:
# CONFIG_LV_USE_ST7735 is not set
# default:
# CONFIG_LV_USE_ST7789 is not set
# default:
# CONFIG_LV_USE_ST7796 is not set
# default:
# CONFIG_LV_USE_ILI9341 is not set
# default:
# CONFIG_LV_USE_GENERIC_MIPI is not set
# default:
# CONFIG_LV_USE_NXP_ELCDIF is not set
# default:
# CONFIG_LV_USE_RENESAS_GLCDC is not set
# default:
# CONFIG_LV_USE_ST_LTDC is not set
# default:
# CONFIG_LV_USE_FT81X is not set
# default:
# CONFIG_LV_USE_UEFI is not set
# default:
# CONFIG_LV_USE_QNX is not set
# end of Devices

#
# Examples
#
# CONFIG_LV_BUILD_EXAMPLES is not set
# end of Examples

#
# Demos
#
# CONFIG_LV_BUILD_DEMOS is not set
# end of Demos
# end of LVGL configuration
# end of Component config

# CONFIG_IDF_EXPERIMENTAL_FEATURES is not set

